**** wrapper classes
     Abstract class: Number
     Derived class:
     Byte, Integer, Short, Long, Float, Double.
     
     int will be boxed to a Integer when consturcting by compiler automaticlly;
     Interger will be unboxed to a int when doing arithmatic operations automaticlly.
     #+begin_src java :classname Test
     class Test {
         public static void main(String[] args) {
             Integer x = 7;
             A a= new A(new Float(10.8));
             System.out.println("x = "+x);
             System.out.println("a = "+a.get());
         }
     }
     class A{
         Float a;
         A(Float ra) {
             a=ra;
         }
         Float get(){
             return a;
         }
     }
     #+end_src
     
     #+RESULTS:
     : x = 7
     : a = 10.8
     
*** many Math static methods
    http://www.tutorialspoint.com/java/java_numbers.htm
    
    1. random
     #+begin_src java :classname Test
     class Test {
         public static void main(String[] args) {
             Double n = new Double(100);
             Double r = Math.random();
             System.out.println(Math.sqrt(n));
             System.out.println(r);
             System.out.println(Math.floor(r));
         }
     }
     #+end_src
       
       #+RESULTS:
     : 10.0
     : 0.23222088111335182
     : 0.0
       
    2. others
       sqrt, pow, ceil, floor, abs, sin, cos, tan, log, round, rint, and so on.
       
**** create a string
       1. by use of string literal
          #+begin_src java :classname Test
          class Test {
              public static void main(String[] args) {
                  String s="AAAABB BBBB";
          System.out.println(s);
              }
          }
          #+end_src
          
          #+RESULTS:
          : AAAABB BBBB
          
       2. by constructer
          String has 11 constructer.
          Below use a char array.
          #+begin_src java :classname Test
          class Test {
              public static void main(String[] args) {
                  char[] ac={'a', 'b', 'c'};
                  String s= new String(ac);
                  System.out.println(ac);
              }
          }
          #+end_src
          
          #+RESULTS:
          : abc
          
          
     
     
**** create a array:
     dataType[] ref=new dataType[arraySize];
     or:
     dataType[] ref={value0, value1, ...};
     
    #+begin_src java :classname Test
    class Test {
        public static void main(String[] args) {
            Integer[] ai = {1,2,3};
            for(Integer i:ai){
                System.out.println(i);
            }
        }
    }
    #+end_src
     
     #+RESULTS:
    : 1
    : 2
    : 3
     
     
     
     
     
     
**** java.util.Arrays static method
     1. public static void fill(int[]a, int val)
        fill an array with value. argument type can be any other primitive type.
        #+begin_src java :classname Test
        import java.util.Arrays;
        class Test {
            public static void main(String[] args) {
                int[] ai={1,2,3};
        Arrays.fill(ai, 5);
        for(int i:ai){
        System.out.println(i);
        }
            }
        }
        #+end_src
        
        #+RESULTS:
        : 5
        : 5
        : 5
        
     2. public static int binarySearch(Object[]a, Object key)
        #+begin_src java :classname Test
        import java.util.Arrays;
        class Test {
            public static void main(String[] args) {
                int[] ai={1,2,3};
        // Arrays.fill(ai, 5);
                System.out.println(Arrays.binarySearch(ai, 2));
            }
        }
        #+end_src
        
        #+RESULTS:
        : 1

     3. public static boolean equals(long[] a, long[] b)
        Check if two arrays have same content.

     4. public static void sort(Object[] a)
        Sort an array.
        
        #+begin_src java :classname Test
        import java.util.Arrays;
        class Test {
            public static void main(String[] args) {
                int[] ai={5, 1, 4, 2,3};
        Arrays.sort(ai);
        for(int i:ai){
        System.out.println(i);
        }
            }
        }
        #+end_src

        #+RESULTS:
        : 1
        : 2
        : 3
        : 4
        : 5

        
        
